Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<BasedOn>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзятыеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.СредстваНаСкладе</xr:Item>
				<xr:Item>AccumulationRegister.СредстваУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИОЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьПомещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЗанятостьСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗанятостьСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занятость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СтатусСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВыезде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заказы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СТЧ = Элементы.Услуги.ТекущиеДанные;
	СТЧ.Цена = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(), СТЧ.Услуга); 
	Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Цена")* Объект.ПлощадьПомещения;
//	ИтогПоЦене();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	//Если ТекущаяДата()>Объект.ВремяОкончанияЗаказа Тогда
	//	Объект.СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СтатусЗаказа.Выполнен");
	//	Объект.СтатусСотрудника =ПредопределенноеЗначение("Перечисление.СтатусСотрудника.Свободен") 
	//Иначе 
	//	Объект.СтатусЗаказа =ПредопределенноеЗначение("Перечисление.СтатусЗаказа.Принят");
	//	Объект.СтатусСотрудника = ПредопределенноеЗначение("Перечисление.СтатусСотрудника.НаВыезде")
	//КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура ФИОСотрудникаПриИзменении(Элемент) 
//	РаботаСдокументами.ПроведениеДока();   
	//Объект.СтатусСотрудника = ПредопределенноеЗначение("Перечисление.СтатусСотрудника.НаВыезде");
	//Если Объект.СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СтатусЗаказа.Выполнен") Тогда
	//	Сообщить("Заказ уже выполнен");
	//Иначе
	//	Объект.СтатусСотрудника = ПредопределенноеЗначение("Перечисление.СтатусСотрудника.НаВыезде")
	//КонецЕсли 
	Если НЕ ПроверитьСотрудника(Объект.ФИОСотрудника) Тогда 
		Сообщить("Этот сотрудник сейчас занят");
		Объект.ФИОСотрудника = Неопределено;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьСотрудника(Сотрудник)
	//Отбор =  Новый Структура("Сотрудник",Сотрудник);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗанятостьСотрудников.Занятость КАК Занятость
		|ИЗ
		|	РегистрСведений.ЗанятостьСотрудников КАК ЗанятостьСотрудников
		|ГДЕ
		|	ЗанятостьСотрудников.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Статус = ВыборкаДетальныеЗаписи.Занятость;
	КонецЕсли;
	//Статус = РегистрыСведений.ЗанятостьСотрудников.ПолучитьПоследнее(ТекущаяДата(),Отбор).Занятость;
	Если Статус = Перечисления.СтатусСотрудника.НаВыезде Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЭкспортТаблицы(Команда)
	П = Новый Структура;
    П.Вставить("Ключ", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Заказы.Форма.ФормаЭкспорта",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Форма= Документы.Заказы.ПолучитьФорму("ФормаЭкспорта",ЭтотОбъект);//ПолучитьФорму("Документ.Заказы.ФормаЭкспорта");
	//Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтоимостьПриИзменении(Элемент)
	//СТЧ = Элементы.Услуги.ТекущиеДанные;
	//СТЧ.Цена = РаботаСоСправочниками.РозничнаяЦена(ТекущаяДата(), СТЧ.Услуга); 
	//Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Цена")* Объект.ПлощадьПомещения;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ИтогПоЦене();
КонецПроцедуры

Процедура ИтогПоЦене()
	Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Цена")*Объект.ПлощадьПомещения;;
КонецПроцедуры
